"""
99 Bottles of Beer (by Gerold Penz)
Python can be simple, too :-)
http://www.99-bottles-of-beer.net

גרסה עברית מאת ניר סופר.
"""

לכל כמות בתוך range(99, 0, -1):
    אם כמות > 1:
        הדפס כמות, "בקבוקי בירה על הקיר,", כמות, "בקבוקים של בירה."
        אם כמות > 2:
            סיומת = str(כמות - 1) + " בקבוקי בירה על הקיר."
        אחרת:
            סיומת = "בקבוק בירה אחד על הקיר."
    אחרתאם כמות == 1:
        הדפס "בקבוק אחד של בירה על הקיר, בקבוק אחד של בירה."
        סיומת = "אין יותר בקבוקי בירה על הקיר!"
    הדפס "קח אחד, תעביר אותו הלאה,", סיומת
    הדפס "--"