""" עץ """

# XXX לתרגם את שם המודול
מתוך hpy.hturtle יבא *

הגדר קפוץ(מרחק):
    מעלה()
    קדימה(מרחק)
    מטה()

הגדר עץ(מפתח, אורך, ענפים):
    אם אורך < 4:
        החזר
    קדימה(אורך)
    שמאלה(מפתח / 2)
    זוית = מפתח / (ענפים - 1)
    לכל א בתוך [זוית] * ענפים:
        עץ(מפתח, אורך / 2, ענפים)
        ימינה(זוית)
    שמאלה(מפתח / 2 + זוית)
    קפוץ(-אורך)

# הגדר את צורת העץ
אורך = גובה_חלון() / 2 * 0.9
מפתח = 210
ענפים = 3

# מרכז את הציור
שמאלה(90)
קפוץ(-אורך)

# צייר עץ
עץ(מפתח, אורך, ענפים)

# המתן על מנת למנוע מהחלון של טיקי להסגר
קלט("הקלד סוף שורה לסיום")

