""" עץ """

מתוך צב יבא *

הגדר קפוץ(מרחק):
    מעלה()
    קדימה(מרחק)
    מטה()

הגדר עץ(מפתח, אורך, ענפים):
    אם אורך < 4:
        החזר
    קדימה(אורך)
    שמאלה(מפתח / 2)
    זוית = מפתח / (ענפים - 1)
    לכל א בתוך [זוית] * ענפים:
        עץ(מפתח, אורך / 2, ענפים)
        ימינה(זוית)
    שמאלה(מפתח / 2 + זוית)
    קפוץ(-אורך)

# הגדר את צורת העץ
אורך = window_height() / 2 * 0.9
מפתח = 210
ענפים = 3

# מרכז את הציור
שמאלה(90)
קפוץ(-אורך)

# צייר עץ
עץ(מפתח, אורך, ענפים)

# המתן למשתמש
raw_input("הקלד סוף שורה (enter), כדי לסיים")

